import nltk

nltk.download('punkt')

response = {
    "привет": "Привет, тебе!",
    "пока": "До свидания!",
    "спасибо": "Пожалуйста!",
    "контакты": "Хотите получить контакты отдела?(да/нет)",
    "дела": "Спасибо! У меня все хорошо!",
    "погода": "Я не умею предсказывать погоду.",
    "умеешь": "Вы можете использовать комманду /help",
    "сигарета": "я не курю."
}


def get_response(text: str) -> str:
    """Функция принимает сообщение от юзера и
    возвращает ответ при нахждении ключевого слова."""
    words = nltk.word_tokenize(text.lower())
    for word in words:
        if word in response:
            return response[word]

    return "Простите, у меня нет ответа."
